#    -*- mode: org -*-


Archived entries from file /home/rkrug/Documents/Projects/AlienSpread/trunc/seeddisp/disp.org


*** svn commit

- At the end of a day's work commit the changes

#+begin_src sh :results output :var TANGLED=(org-babel-tangle) :tangle no
  echo "  l   w   b     fn"
  wc $TANGLED
  ./postTangleScript.sh
  svn commit  -m "edits"
#+end_src

#+results:
#+begin_example
  l   w   b     fn
  46  182 1257 ./src/windDispCpp.cpp
  22  108  681 ./src/windDispCpp.h
  22   56  468 ./man/disp-package.Rd
  28  104  718 ./man/windDisp.Rd
  36  166 1148 ./R/windDisp.R
   2    2   51 ./NAMESPACE
  12   39  323 ./DESCRIPTION
   3   19  172 ./src/Makevars.win
  26  147  960 ./src/Makevars
  25   43  463 ./postTangleScript.sh
 222  866 6241 total
Sending        disp.org
Sending        .Rbuildignore
Sending        DESCRIPTION
Sending        R/windDisp.R
Sending        postTangleScript.sh
Transmitting file data .....
Committed revision 6.
#+end_example

